app/embarques/app/Models/UsersModel.php

SELECT *
FROM `users`
WHERE `user` = 'Admin'
AND `active` = 1
 LIMIT 1
---
    public function validateUser($user,$password){
        $user= $this->where(['user'=>$user,'active'=>1])->first();