app/embarques/app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `reset_token` = 'cc45283a0da0f658885316f595acef55acc2274971'
 LIMIT 1
---
    public function resetPasswordForm($token){
        $userModel=new UsersModel();
        $user= $userModel->where(['reset_token'=>$token])->first();

SELECT *
FROM `users`
WHERE `reset_token` = 'cc45283a0da0f658885316f595acef55acc2274971'
AND `active` = 1
 LIMIT 1
---
    public function resetPassword(){
        $rules=[
            'password' => 'required|max_length[50]|min_length[5]',
            'repassword' => 'matches[password]',
        ];
        if(!$this->validate($rules)){
            return redirect()->back()->withInput()->with('errors',$this->validator->listErrors());
        }
        $userModel= new UsersModel();
        $post= $this->request->getPost(['token','password']);
        $user = $userModel->where(['reset_token' => $post['token'],'active'=>1])->first();

SELECT *
FROM `users`
WHERE `email` = 'erodriguez@grupomar.com'
AND `active` = 1
 LIMIT 1
UPDATE `users` SET `reset_token` = 'cc45283a0da0f658885316f595acef55acc2274971', `reset_token_expires_at` = '2024-10-08 11:27:45', `updated_at` = '2024-10-08 10:27:45'
WHERE `users`.`id` IN ('1')
---
    public function sendResetLinkEmail(){
        $rules=[
            'email' => 'required|min_length[4]|valid_email',
        ];
        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->listErrors());
        }
        $userModel= new UsersModel();
        $post= $this->request->getPost(['email']);
        $user = $userModel->where(['email'=>$post['email'],'active'=>1])->first();
        if ($user){
            $token=bin2hex(random_bytes(21));
            $expiresAt = new \DateTime();
            $expiresAt->modify('+1 hour');
            $userModel->update($user['id'],[
                'reset_token' => $token,
                'reset_token_expires_at' => $expiresAt->format('Y-m-d H:i:s'),
            ]);